


##############################################################################
# fix issue:
##############################################################################

fix.ios:
	rm -rf ios/


fix.ios.gen:
	flutter create  --project-name=flutter_unit .

##############################################################################
# run:
##############################################################################


# 打开模拟器:
open.sim:
	open -a Simulator


# 选择版本:
fvm.use:
	fvm use 1.20.2
	fvm flutter --version

# 启动:
fvm.run:
	fvm flutter run

# 清理:
clean:
	fvm flutter clean


